angular.module('services').service('validateService',['$rootScope',function($rootScope){
    "use strict";
	var validateRegExp = {
		commonSymbol: "\\.\\,\\`\\~\\!\\@\\#\\$\\%\\\\^\\&\\*\\(\\)\\-\\_\\=\\+\\[\\{\\]\\}\\\\|\\;\\:\\‘\\’\\“\\”\\<\\>\\/?",//符号
	    username: "^(?!([0-9]+)$)[A-Za-z0-9]{6,18}$",//用户名
	    password: "^[A-Za-z0-9\\.\\,\\`\\~\\!\\@\\#\\$\\%\\\\^\\&\\*\\(\\)\\-\\_\\=\\+\\[\\{\\]\\}\\\\|\\;\\:\\‘\\’\\“\\”\\<\\>\\/?]{6,18}$",
	    mobile: "^[0-9]{11}$",//手机号
	    email: "^\\w[\\w\\$\\^\\(\\)\\[\\]\\{\\}\\.\\-\\+,]{0,100}@([a-zA-Z0-9][\\w\\-]*\\.)+[a-zA-Z]{2,6}$",//邮箱
	    //email: "^\\w+((-\\w+)|(\\.\\w+))*\\@[A-Za-z0-9]+((\\.|-)[A-Za-z0-9]+)*\\.[A-Za-z0-9]+$",
	    tel: "^[0-9\-()（）]{7,18}$",// 电话号码的函数(包括验证国内区号,国际区号,分机号)
	    letterAndNum: "^[A-Za-z0-9\-\－]+$",//大小写字母和数字
		bankAcount:"^(\\d{15,25})$"//16位或者19位银行账号(\\d{16}|\\d{19})
	};
	return validateRegExp;
}]);
